buzzonemo/STM32_Learning/6/6-1 TIM中断/System/Timer.c
#include "stm32f10x.h"                  // Device header

uint8_t num;

void Timer_Init(void){
	
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	
	//选择时钟源
	TIM_InternalClockConfig(TIM2);
	
	
	
	//配置时基单元
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
	// 重载寄存器
	TIM_TimeBaseInitStruct.TIM_Period = 10000 - 1;
	// 预分频寄存器
	TIM_TimeBaseInitStruct.TIM_Prescaler = 7200 - 1;
	TIM_TimeBaseInitStruct.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStruct);
	
	// 清除标志位，防止开启时钟中断后立即进入一次中断
	TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	
	
	//配置中断输出部分
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
	
	//配置NVIC
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStruct;
	NVIC_InitStruct.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStruct);
	
	//配置运行控制部分
	TIM_Cmd(TIM2, ENABLE);
	

}

void TIM2_IRQHandler(){
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET){
		num++;
	}

	TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
}
